[
  {
    "id": 7,
    "title": "Winning my first hackathon",
    "date": "August 9th, 2024",
    "content": "From August 2nd to August 4th, I attended my first ever in-person hackathon with a group of friends. Amazingly, we ended up winning a major category in the hackathon. For some reason, it's always in these moments of success that I start to feel like a failure. It feels good to win the hackathon, but as weird as it sounds, I feel better for being a good teammate within my group. I wanted to be a good groupmate by cooperating well and being able to pull my own weight, and I was able to do that. Winning the hackathon also made me realize how little I know—I still have so much to learn to become an even better software developer. Even if I did win, I have to acknowledge that the work doesn’t end there. I still have to keep learning constantly and remain open to continual growth. I need to make sure that this hackathon win doesn’t inflate my ego or blind me to my flaws and the areas I need to work on. I still have so much to learn about myself, and I need to stay humble and keep an open mind. In the end, I’m grateful for the experience that HackThe6ix has given me. The opportunity to develop software with such a fun and amazing group will be a memory I will never forget. All in all, I’m just very grateful that I had the opportunity to attend the hackathon. Being able to keep learning constantly, to get 1% better every single day, is such a privilege that I’ve taken for granted time and time again. It’s truly in these moments that I realize how lucky I am—to be able to work hard and keep bettering myself every single day is something that I won’t take for granted again."
  },
  {
    "id": 6,
    "title": "Trying to let go of my ego",
    "date": "August 9th, 2024",
    "content": "Mastering my own ego has been something I've been struggling with for years. Thinking that I'm better than everyone else, that I'm smarter than everyone else, even though I have so much to learn, is truly a problem that I've been trying to let go of. I think of ego like a plate of armor protecting you from mental turmoil. Back then, I think I didn't know how to truly deal with criticism and failure. Because of this, I developed a thick ego to protect myself. I think the key to letting go of my ego was not only understanding myself more, but to understand how to healthily deal with failure and criticism. Once I started to focus on that, I was able to slowly let go of my ego, to make the armor of my ego thinner and thinner until the failure and criticism I was dealt was tangible to learn from effectively. Even though I'm still learning how to let go of my ego even today, I'm glad I made a conscious effort to do so. Over the past few years, I've learned and improved so much more because I could look at myself honestly and determine what I needed to learn. It's also nice to be a positive influence among everyone in my life. Letting go of my ego also allowed me to let go of my jealousy of others in an easier way. Even though I've gotten so far in my learning journey, there's still so much more I have to learn and accomplish. In the end, I hope to be a kinder, better person as I strive to get better every day."
  },
  {
    "id": 5,
    "title": "Being grateful for the things at hand",
    "date": "August 12th, 2024",
    "content": "The more I live my life, the more I realize how lucky I am to be living the life I have. Back then, I wasn't grateful for anything. As someone with high-achieving goals, I always sulked at the fact that I couldn't get what I wanted how I wanted. Even if sometimes in life you don't get what you want, I'm so grateful for the life that I have right now. To be able to go to the University of Toronto, to be able to get an education in computer science at a recognized school really does mean the world to me. It took me so long to realize how privileged I was. I think it was due to a lack of perspective. I was so focused on what I wanted and on what I didn't have that I never realized what I already had in my life and how it was enough to satisfy me. Having this newfound appreciation really makes me realize how I take a lot of things for granted, and how lucky I am to be living my life. This realization gives me the drive to keep improving and to keep working hard. The opportunities that I currently have in my life are opportunities that I recognize I'm able to get simply because I am lucky to live such a blessed life. I'm safe, I have the agency to work hard and study hard. What more could I ask for? The ability to work on myself daily is the biggest privilege in my life that I will never take for granted ever again."
  },
  {
    " id": 4,
    "title": "The act of mastering self-awareness",
    "date": "August 13th, 2024",
    "content": "One of the key values that I follow in my life is to learn from my mistakes as deeply and quickly as possible. Although it's hard, I acknowledge that it's a key character trait for bettering myself. Looking back on my life, I realize there were so many moments where I was blind to the mistakes that I made. This is what truly scares me the most: not realizing the mistakes you've made or the actions you've taken. Because ultimately, you won't be able to learn from them if you don't know that you've committed them in the first place. This is why I try to focus as much as possible on the ability to recognize the mistakes I've made. As weird as it sounds, it involves a lot of practice. It involves daily reflection, whether it's writing in a journal or sitting down by yourself, quietly thinking about how your day went. It involves thinking about every particular moment that happened in your day: the happy moments, the sad moments, and the worst of all, the embarrassing or hurtful moments that you want to forget instantly. As hard as it is to do this, I realize that it is these embarrassing and hurtful moments that offer you the greatest practice in your self-reflection skills. Learning how to be honest with your feelings and feeling vulnerable enough to experience these emotions is key to becoming not only self-aware but also emotionally mature, of which self-awareness is definitely a key part. I think understanding your emotions helps you understand yourself as well as the other people around you. When you understand your emotions and why you feel them, you also have a better understanding of the emotions of those around you and why other people feel the way they're feeling. As useless as this may sound to a lot of people, I believe this is a key human character trait that is so important in day-to-day life."
  },
  {
    " id": 3,
    "title": "Standing on the shoulder of giants",
    "date": "November 3th, 2024",
    "content": "Something that I never realized that is still integral in my life today is the support system that I have. I was born and raised in an amazing family, with supportive parents, and a caring brother that always cared about my life every step of the way. I attribute all my success, the life that I live, and everything that defines me to my family and closest friends. My success is my family's success. My happiness is my family's happiness. The life that I can strive to live for today is due to them. They support me throughout it all: When I'm doubtful, when I feel like I'm not enough, when I'm struggling to make it through life, my family grounds me. They make me realize that throughout thick and thin, I am enough. That no matter how hard I fail and fall, I will always be able to get back up and be stronger. As hard as I try to live through life by embracing the ups and downs, the struggles as well as the triumphant moments, there are times when I feel discouraged. There have been countless times where I've felt unworthy, simply not enough to live the life that I strive to live for. I've accepted that this is normal. Everyone feels doubtful about their life at some point. Everyone feels unworthy. At some point, everyone feels like they aren't enough. It is in these times that my family and friends have grounded me - In a time of anxiety and depeseration, they make sure that I'm okay. When I feel this way, my parents, brother, and dearest friends have shown me their support time and time again. They have shown me that it's normal to feel these emotions, and that no matter how I feel, I'll always have their support. I stand on the shoulder of giants, and I will never forget how lucky I am. My success, who I am as a person, and how far I'll go in life is ultimately due to the people that supported me throughout the tough times in my life, and I'll never forget that."
  },
  {
    " id": 2,
    "title": "Living for myself",
    "date": "November 4th, 2024",
    "content": "As I enter the new school year, I've started to follow one rule: To do the things that I find fulfilling. When I first became a student at the University of Toronto, I was driven to do things that my parents and what society implied was good for me: Work hard, find a good job and get a stable income. I realized that as I followed this more and more, I felt hollow and empty on the inside, like I wasn't fulfilled at all. I forced myself to do the things that were necessary for what others thought was their idea of 'success' instead of my own. In the end, I started to lose sight of myself and who I fundamentally was. It was almost like I was trying to pretend to be someone that I didn't want to be. It was in these moments that I realized how dangerous this was. I've always believed in being honest with myself and my mistakes. One of my core fundamental values is to fail quickly and learn quickly. By identifying what mistakes and things you can learn from as soon as possible, you can become a better person than before by growing from your mistakes and failures. I found that once I started to live the life that others wanted for me, instead of my own, I started to have trouble distinguishing what mistakes I made and how I wanted to learn from them. Ultimately, it was because I started to lose sight of what I wanted in my life and how I wanted to live my life. Without this fundamental understanding, I was left without clear reasoning in how I wanted to better myself, and what actions I considered mistakes and other successes. It wasn't until I started to understand myself better that I had a clear direction in how learning from my mistakes shaped me, and the type of person that I wanted to be in the future. This is precisely why living your life based on your morals and values are important. Not only does it pave a clear path for where you want to go with your life, but it paints the picture of how you want to better yourself. It defines how mistakes and failure affect your life, and how it can be used to change your life for the better or worse."
  },
  {
    "id": 1,
    "title": "The fragility of life",
    "date": "November 5th, 2024",
    "content": "I'm constantly amazed by how quickly life can turn upside down. Major transitions highlight the uniqueness of each person’s journey and how everything can change in an instant. Moving from high school to university, I often reflect on where my friends have ended up, each path diverging in unexpected ways.\n\nI’ve heard it all—the good and the bad. Friends thriving in California, working for Amazon or in the Financial District. Others getting married young and moving to Dallas, Texas. But I’ve also heard about the struggles: academic probation from their first year of university, unemployment, and tough times survived on thin personal finances. Some have felt lost, unsure of how to get back on track.\n\nThese stories remind me how fragile life is—how you can be safe, healthy, and happy one moment, only to have everything change in an instant. I feel a mix of emotions when I hear them: sadness, happiness, but most of all, gratitude. I’m deeply grateful for the life I have now. It humbles me, knowing how easily things could have turned out differently.\n\nThis realization pushes me to make the most of my life, to fully embrace the potential it holds."
  }
]
