[
  {
    "id": 7,
    "title": "Winning my first hackathon",
    "date": "August 9th, 2024",
    "content": "From August 2nd to August 4th, I attended my first ever in-person hackathon with a group of friends. Amazingly, we ended up winning a major category in the hackathon. For some reason, it's always in these moments of success that I start to feel like a failure. It feels good to win the hackathon, but as weird as it sounds, I feel better for being a good teammate within my group. I wanted to be a good groupmate by cooperating well and being able to pull my own weight, and I was able to do that. Winning the hackathon also made me realize how little I know—I still have so much to learn to become an even better software developer. Even if I did win, I have to acknowledge that the work doesn’t end there. I still have to keep learning constantly and remain open to continual growth. I need to make sure that this hackathon win doesn’t inflate my ego or blind me to my flaws and the areas I need to work on. I still have so much to learn about myself, and I need to stay humble and keep an open mind. In the end, I’m grateful for the experience that HackThe6ix has given me. The opportunity to develop software with such a fun and amazing group will be a memory I will never forget. All in all, I’m just very grateful that I had the opportunity to attend the hackathon. Being able to keep learning constantly, to get 1% better every single day, is such a privilege that I’ve taken for granted time and time again. It’s truly in these moments that I realize how lucky I am—to be able to work hard and keep bettering myself every single day is something that I won’t take for granted again."
  },
  {
    "id": 6,
    "title": "Trying to let go of my ego",
    "date": "August 9th, 2024",
    "content": "Mastering my own ego has been something I've been struggling with for years. Thinking that I'm better than everyone else, that I'm smarter than everyone else, even though I have so much to learn, is truly a problem that I've been trying to let go of. I think of ego like a plate of armor protecting you from mental turmoil. Back then, I think I didn't know how to truly deal with criticism and failure. Because of this, I developed a thick ego to protect myself. I think the key to letting go of my ego was not only understanding myself more, but to understand how to healthily deal with failure and criticism. Once I started to focus on that, I was able to slowly let go of my ego, to make the armor of my ego thinner and thinner until the failure and criticism I was dealt was tangible to learn from effectively. Even though I'm still learning how to let go of my ego even today, I'm glad I made a conscious effort to do so. Over the past few years, I've learned and improved so much more because I could look at myself honestly and determine what I needed to learn. It's also nice to be a positive influence among everyone in my life. Letting go of my ego also allowed me to let go of my jealousy of others in an easier way. Even though I've gotten so far in my learning journey, there's still so much more I have to learn and accomplish. In the end, I hope to be a kinder, better person as I strive to get better every day."
  },
  {
    "id": 5,
    "title": "Being grateful for the things at hand",
    "date": "August 12th, 2024",
    "content": "The more I live my life, the more I realize how lucky I am to be living the life I have. Back then, I wasn't grateful for anything. As someone with high-achieving goals, I always sulked at the fact that I couldn't get what I wanted how I wanted. Even if sometimes in life you don't get what you want, I'm so grateful for the life that I have right now. To be able to go to the University of Toronto, to be able to get an education in computer science at a recognized school really does mean the world to me. It took me so long to realize how privileged I was. I think it was due to a lack of perspective. I was so focused on what I wanted and on what I didn't have that I never realized what I already had in my life and how it was enough to satisfy me. Having this newfound appreciation really makes me realize how I take a lot of things for granted, and how lucky I am to be living my life. This realization gives me the drive to keep improving and to keep working hard. The opportunities that I currently have in my life are opportunities that I recognize I'm able to get simply because I am lucky to live such a blessed life. I'm safe, I have the agency to work hard and study hard. What more could I ask for? The ability to work on myself daily is the biggest privilege in my life that I will never take for granted ever again."
  },
  {
    " id": 4,
    "title": "The act of mastering self-awareness",
    "date": "August 13th, 2024",
    "content": "One of the key values that I follow in my life is to learn from my mistakes as deeply and quickly as possible. Although it's hard, I acknowledge that it's a key character trait for bettering myself. Looking back on my life, I realize there were so many moments where I was blind to the mistakes that I made. This is what truly scares me the most: not realizing the mistakes you've made or the actions you've taken. Because ultimately, you won't be able to learn from them if you don't know that you've committed them in the first place. This is why I try to focus as much as possible on the ability to recognize the mistakes I've made. As weird as it sounds, it involves a lot of practice. It involves daily reflection, whether it's writing in a journal or sitting down by yourself, quietly thinking about how your day went. It involves thinking about every particular moment that happened in your day: the happy moments, the sad moments, and the worst of all, the embarrassing or hurtful moments that you want to forget instantly. As hard as it is to do this, I realize that it is these embarrassing and hurtful moments that offer you the greatest practice in your self-reflection skills. Learning how to be honest with your feelings and feeling vulnerable enough to experience these emotions is key to becoming not only self-aware but also emotionally mature, of which self-awareness is definitely a key part. I think understanding your emotions helps you understand yourself as well as the other people around you. When you understand your emotions and why you feel them, you also have a better understanding of the emotions of those around you and why other people feel the way they're feeling. As useless as this may sound to a lot of people, I believe this is a key human character trait that is so important in day-to-day life."
  },
  {
    " id": 3,
    "title": "Standing on the shoulder of giants",
    "date": "November 3th, 2024",
    "content": "Something I've come to realize, which remains integral in my life today, is the strength of the support system I have. I was born and raised in a loving family, with supportive parents and a caring brother who has been there every step of the way. I attribute all my success, the life I live, and everything that defines me to my family and closest friends. My success is their success; my happiness is their happiness. The life I strive for today is because of them. They support me through it all: when I'm doubtful, when I feel inadequate, when I'm struggling to make it through. My family grounds me. They remind me that, through thick and thin, I am enough. No matter how hard I fall, they show me I can get back up and become stronger. Despite embracing the ups and downs of life, there are times when I feel discouraged. I've faced countless moments of feeling unworthy or not enough to live the life I aspire to. I've accepted that this is normal—everyone feels doubt at some point. Everyone has moments when they feel unworthy or insufficient. In these times, my family and friends ground me. In moments of anxiety and desperation, they ensure that I'm okay. When I feel this way, my parents, brother, and closest friends have consistently shown their support. They remind me that these emotions are normal and that, no matter what, I'll always have their backing. I stand on the shoulders of giants, and I’ll never forget how fortunate I am. My success, who I am as a person, and how far I’ll go in life are ultimately thanks to the people who supported me through tough times. I’ll always remember that."
  },
  {
    " id": 2,
    "title": "Living for myself",
    "date": "November 4th, 2024",
    "content": "As I enter the new school year, I've adopted one guiding principle: to pursue the things that genuinely fulfill me. When I first became a student at the University of Toronto, I was driven by what my parents and society implied was good for me: work hard, secure a good job, and earn a stable income. But the more I followed this path, the emptier I felt, as if something essential was missing. I realized I was doing what others thought defined 'success,' not what resonated with me personally. Eventually, I began to lose sight of who I truly was, almost as though I was trying to fit into someone else's mold. It was then that I recognized the potential danger in this. I’ve always believed in being honest with myself and owning my mistakes. A core value of mine is to 'fail quickly and learn quickly'—identifying mistakes and learning from them as soon as possible to grow and improve. But when I started living the life others envisioned for me, I found it difficult to discern my own mistakes and growth opportunities. I lost clarity on what I wanted and how I wanted to live. Without that personal understanding, I struggled to evaluate my progress or define what counted as a mistake or a success. Only when I started reconnecting with myself did I regain a clear direction for how I wanted to grow and the person I aspired to become. This is why living according to your own values and principles is so important. It not only sets a clear path for your life but also shapes how you view growth and improvement. It defines how mistakes and failures influence you and whether they become catalysts for positive change."
  },
  {
    "id": 1,
    "title": "The fragility of life",
    "date": "November 5th, 2024",
    "content": "I'm constantly amazed by how quickly life can turn upside down. Major transitions highlight the uniqueness of each person’s journey and how everything can change in an instant. Moving from high school to university, I often reflect on where my friends have ended up, each path diverging in unexpected ways.\n\nI’ve heard it all—the good and the bad. Friends thriving in California, working for Amazon or in the Financial District. Others getting married young and moving to Dallas, Texas. But I’ve also heard about the struggles: academic probation from their first year of university, unemployment, and tough times survived on thin personal finances. Some have felt lost, unsure of how to get back on track.\n\nThese stories remind me how fragile life is—how you can be safe, healthy, and happy one moment, only to have everything change in an instant. I feel a mix of emotions when I hear them: sadness, happiness, but most of all, gratitude. I’m deeply grateful for the life I have now. It humbles me, knowing how easily things could have turned out differently.\n\nThis realization pushes me to make the most of my life, to fully embrace the potential it holds."
  }
]
